---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.WallFoundation
source: html/d91f4b5a-1bdc-8ef1-0ae5-d2943996dd05.htm
---
# WallFoundation Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.